#საწყისი მდგომარეობა
bank_name = "PythonBank"
account_number = "12345"   # მომხმარებლის ანგარიშის ნომერი (string)
password = "PROJECT"          # მომხმარებლის საწყისი პაროლი (string)

#მომხმარებლის სტატუსი და ბალანსი
is_vip = True        # VIP კლიენტია თუ არა (bool)
balance = 4000.00    # ბალანსი ანგარიშზე (float)

#ლიმიტები VIP-სთვის და ჩვეულებრივი კლიენტისთვის
if is_vip == True:
    daily_withdraw_limit = 2000.00       # VIP-ის ყოველდღიური ფულის გამოტანის ლიმიტი
    per_withdraw_limit = 1000.00         # VIP-ის ერთხელ ფულის გამოტანის ლიმიტი
else:
    daily_withdraw_limit = 1000.00       # ჩვეულებრივიკლიენტის ყოველდღიური ფულის გამოტანის ლიმიტი
    per_withdraw_limit = 500.00          # ჩვეულებრივი კლიენტის ერთხელ ფულის გამოტანის ლიმიტი

#დღემდე გატანილი თანხა
withdraw_today = 0.00


# მისალმება
print("================================================")
print()
print("კეთილი იყოს თქვენი მობრძანება", bank_name,"-ში!")
print()
print("================================================")
print()


# შესვლა
account_number = "12345"

for i in range(3):
    entered_account = input("შეიყვანეთ ანგარიშის ნომერი: ")

    if entered_account == account_number:
        print("ანგარიშის ნომერი სწორია ")
        break
    else:
        print("ანგარიშის ნომერი არასწორია ")

# თუ ეს იყო ბოლო ცდა
        if i == 2:
            print("მაქსიმალური ცდების რაოდენობა ამოიწურა. ანგარიში დაბლოკილია")

print(f"თქვენს ბალანსზე არის {balance} ლარი" )
if input("გსურთ თანხის გამოტანა?(კი,არა):")=="კი":
    A=float(input("ჩაწერეთ თუ რა თანხის გამოტანა გსურთ:"))

















































