# 1)შექმენით სია ---> [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
#  ამ სიის ბოლოში დაამატე სიტყვა --> "ianvari" და დაპრინტე საბოლოო სია ნახე დაემატა თუ არა
a = [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
a.append("ianvari")
print(a)


# 2)შექმენი სია ---> [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
#  ამ სიაში მეორე ინდექსზე დაამატე სიტყვა ---> "bati" და დაპრინტე საბოლოო სია ნახე დაემატა თუ არა
b = [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
b.insert(2 , "bati")
print(b)


# 3)შექმენი სია ---->  [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5] 
# ამ სიიდან ამოშალე მე 5 ინდექსზე მდგომი ელემენტი და დაპრინტე საბოლოო სია ნახე ამოიშალა თუ არა
c = [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
c.pop(5)
print(c)


# 4)შექმენი სია --->  [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5] 
# ამ სიიდან ამოშალე True და ასევე ამოშალე "kote" და დაპრინტე საბოლოო სია და ნახე ამოიშალა თუ არა
d = [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
d.remove(True)
d.remove("kote")
print(d)