# ჩვენ ვისწავლეთ ** , % და // მათემატიკური ოპერატორები... ** პირველ რიცხვს ახარისხებს მეორეზე,
# % ერთი რიცხვის მეორეზე გაყოფისას გამოგვიტანს ნაშთს, // გვაჩვენებს თუ პირველი რიცხვი მეორეში რამდენჯერ მოთავსდება.

# print(10//5)
# print(14//5)
# print(123//34)

# print(12**3)
# print(3**8)
# print(7**9)

# print(15%5)
# print(5%3)
# print(40%21)


# სიები და ცვლადები ერთმანეთისგან იმით განსხვავდებიან, რომ სიაში ბევრი მნიშვნელობის, ხოლო ცვლადში ერთი მნიშვნელობის ჩაწერა შეიზლება
# სიას იყენებენ ერთ ცვლადში ბევრი რამის შესანახად

list=[True , 10 , 4.7 , "data"]
print(list)
